{"description":"","props":{"animate":{"type":{"name":"object"},"required":false,"description":"The animate prop specifies props for victory-animation to use. It this prop is\ngiven, all children defined in chart will pass the options specified in this prop to\nvictory-animation, unless they have animation props of their own specified.\nLarge datasets might animate slowly due to the inherent limits of svg rendering.\n@examples {velocity: 0.02, onEnd: () => alert(\"woo!\")}"},"domain":{"type":{"name":"union","value":[{"name":"array"},{"name":"shape","value":{"x":{"name":"array","required":false},"y":{"name":"array","required":false}}}]},"required":false,"description":"The domain prop describes the range of values your chart will include. This prop can be\ngiven as a array of the minimum and maximum expected values for your chart,\nor as an object that specifies separate arrays for x and y.\nIf this prop is not provided, a domain will be calculated from data, or other\navailable information.\n@examples: [-1, 1], {x: [0, 100], y: [0, 1]}"},"domainPadding":{"type":{"name":"shape","value":{"x":{"name":"number","required":false},"y":{"name":"number","required":false}}},"required":false,"description":"The domainPadding prop specifies a number of pixels of padding to add to the\nbeginning and end of a domain. This prop is useful for explicitly spacing ticks farther\nfrom the origin to prevent crowding. This prop should be given as an object with\nnumbers specified for x and y."},"height":{"type":{"name":"number"},"required":false,"description":"The height props specifies the height of the chart container element in pixels","defaultValue":{"value":"300","computed":false}},"padding":{"type":{"name":"union","value":[{"name":"number"},{"name":"shape","value":{"top":{"name":"number","required":false},"bottom":{"name":"number","required":false},"left":{"name":"number","required":false},"right":{"name":"number","required":false}}}]},"required":false,"description":"The padding props specifies the amount of padding in number of pixels between\nthe edge of the chart and any rendered child components. This prop can be given\nas a number or as an object with padding specified for top, bottom, left\nand right.","defaultValue":{"value":"50","computed":false}},"scale":{"type":{"name":"union","value":[{"name":"func"},{"name":"shape","value":{"x":{"name":"func","required":false},"y":{"name":"func","required":false}}}]},"required":false,"description":"The scale prop determines which scales your chart should use. This prop can be\ngiven as a function, or as an object that specifies separate functions for x and y.\n@examples d3.time.scale(), {x: d3.scale.linear(), y: d3.scale.log()}"},"standalone":{"type":{"name":"bool"},"required":false,"description":"The standalone prop determines whether the component will render a standalone svg\nor a <g> tag that will be included in an external svg. Set standalone to false to\ncompose VictoryChart with other components within an enclosing <svg> tag.","defaultValue":{"value":"true","computed":false}},"style":{"type":{"name":"object"},"required":false,"description":"The style prop specifies styles for your chart. Victory Chart relies on Radium,\nso valid Radium style objects should work for this prop, however height, width, and margin\nare used to calculate range, and need to be expressed as a number of pixels\n@examples {background: transparent, margin: 50}"},"width":{"type":{"name":"number"},"required":false,"description":"The width props specifies the width of the chart container element in pixels","defaultValue":{"value":"450","computed":false}}}}